document.addEventListener('DOMContentLoaded', () => {
    const input = document.getElementById('id-input');
    const btn = document.getElementById('verify-btn');
    const msg = document.getElementById('msg-box');
    const loader = document.getElementById('loader');

    // قائمة الـ IDs المسموح بها (أضف أرقامك هنا)
    const WHITELIST = [
        "1528434705",
        "1536920899",
        "1528439451",
        "1533279139",
        "1536337125",
        "1493844875",
        "1536997879",
        "1536362199",
        "1536379869",
        "1510814303",
        "1536956053",
        "1517239267",
        "1535973387",
        "1536033443",
        "1536273225",
        "1536236869",
        "1536743683",
        "1536306729",
        "1536261241",
        "1536237711",
        "1536114573",
        "1535975859",
        "1534793571",
        "1536069785",
        "1536280527",
        "1536253563",
        "1534831395",
        "1536038557",
        "1535863771",
        "1535871349",
        "1535869083",
        "1535622271",
        "1534512835",
        "1534040611",
        "1532899929",
        "1536237711",
        "1536024979",
        "1533931703",
        "1532574641",
        "1533216941",
        "1528549069",
        "1530980743",
        "1533208547",
        "1532843657",
        "1533388045",
        "1533620723",
        "1533886981",
        "1533166065",
        "1533395239",
        "1533317167",
        "1508204535",
        "1533355165",
        "1532846819",
        "1532550545",
        "1532275973",
        "1533116703",
        "1532884351",
        "1532259755",
        "1532314017",
        "1532326755",
        "1532769767",
        "1531487227",
        "1532284125",
        "1531520607",
        "1532263009",
        "1531109545",
        "1531409411",
        "1531391251",
        "1531417241",
        "1530381955",
        "1531167621",
        "1531307255",
        "1511614225",
        "1531131059",
        "1531271219",
        "1531366041",
        "1531217665",
        "1525205739",
        "1529717413",
        "1532172837",
        "1530204815",
        "1530214113",
        "1530760019",
        "1529878271",
        "1529904839",
        "1528578297",
        "1531125853",
        "1529895797",
        "1530196115",
        "1530316625",
        "1530130521",
        "1529815045",
        "1528747423",
        "1529941935",
        "1530104925",
        "1529840361",
        "1532879993",
        "1528468559",
        "1528646957",
        "1528509263",
        "1528844711",
        "1529601737",
        "1529473613",
    ];

    input.addEventListener('input', () => {
        input.value = input.value.replace(/[^0-9]/g, ''); // يقبل كل الأرقام 0-9
        msg.style.display = 'none';
    });

    btn.addEventListener('click', () => {
        const val = input.value.trim();
        if (val.length !== 9 && val.length !== 10) {
            msg.textContent = "يجب إدخال 9 أو 10 رقماً";
            msg.style.display = 'block';
            return;
        }

        btn.style.display = 'none';
        loader.style.display = 'block';

        setTimeout(() => {
            if (WHITELIST.includes(val)) {
                localStorage.setItem('vinis_user', val);
                window.location.href = "results.html";
            } else {
                loader.style.display = 'none';
                btn.style.display = 'block';
                msg.textContent = "هذا الـ ID غير مصرح له";
                msg.style.display = 'block';
            }
        }, 1500);
    });

});







































































































